In [1]:
import pandas as pd
import csv

# Import files

In [2]:
movies_2018 = pd.read_csv("Resources/2018 pull/TMDB_pull_FINAL_2018_dropped_movies_17079.csv")
netflix = pd.read_csv("Resources/Netflix_data/TMDB_pull_FINAL_Netflix_dropped_movies_524.csv")
omdb_2015 = pd.read_csv("Resources/OMDB_pulls/OMDB_pull_2015_error_count515.csv")
omdb_2016 = pd.read_csv("Resources/OMDB_pulls/OMDB_pull_2016_error_count644.csv")
omdb_2017 = pd.read_csv("Resources/OMDB_pulls/OMDB_pull_2017_error_count858.csv")
omdb_2018 = pd.read_csv("Resources/OMDB_pulls/OMDB_pull_2018_error_count1302.csv")
omdb_2019 = pd.read_csv("Resources/OMDB_pulls/OMDB_pull_2019_error_count1835.csv")
movie_title = pd.read_csv("Resources/movie_title.csv")

# Delete Columns From OMDB

In [3]:
# Unnamed: 0,primaryTitle, startYear, Title
def delete_columns(file):
    del file["Unnamed: 0"]
    del file["startYear"]
    del file["primaryTitle"]
    del file["Title"]

In [4]:
delete_columns(omdb_2015)
delete_columns(omdb_2016)
delete_columns(omdb_2017)
delete_columns(omdb_2018)
delete_columns(omdb_2019)

In [5]:
omdb_2015.head()

      tconst Metascore imdbRating imdbVotes
0  tt0191476       NaN        5.9       118
1  tt0283440       NaN        NaN       NaN
2  tt0297400       NaN        6.7        85
3  tt0337926       NaN        6.1       569
4  tt0346045       NaN        6.5        30

# Clean movie_title

In [6]:
del movie_title["Unnamed: 0"]
del movie_title["isAdult"]

In [7]:
movie_title.head()

,tconst,titleType,primaryTitle,startYear,genres
0,tt0069049,movie,The Other Side of the Wind,2018,Drama
1,tt0072306,movie,Toula ou Le génie des eaux,2017,Drama
2,tt0077649,movie,Isolation of 1/8800000,2018,\N
3,tt0100275,movie,The Wandering Soap Opera,2017,"Comedy,Drama,Fantasy"
4,tt0111414,movie,A Thin Life,2018,Comedy

In [8]:
full_list = omdb_2015

In [9]:
full_list.head()

      tconst Metascore imdbRating imdbVotes
0  tt0191476       NaN        5.9       118
1  tt0283440       NaN        NaN       NaN
2  tt0297400       NaN        6.7        85
3  tt0337926       NaN        6.1       569
4  tt0346045       NaN        6.5        30

# Add OMDB to full_list

In [10]:
full_list = full_list.append(omdb_2016)
full_list = full_list.append(omdb_2017)
full_list = full_list.append(omdb_2018)
full_list = full_list.append(omdb_2019)
final_list = full_list
full_list = []

In [11]:
final_list.count()

tconst        84294
Metascore      9043
imdbRating    38941
imdbVotes     38939
dtype: int64

In [12]:
final_list = pd.merge(movie_title,final_list,on='tconst',how='outer')

In [13]:
final_list.head()

,tconst,titleType,primaryTitle,startYear,genres,Metascore,imdbRating,imdbVotes
0,tt0069049,movie,The Other Side of the Wind,2018,Drama,78,6.8,"5,960"
1,tt0072306,movie,Toula ou Le génie des eaux,2017,Drama,NaN,6.4,8
2,tt0077649,movie,Isolation of 1/8800000,2018,\N,NaN,6.9,17
3,tt0100275,movie,The Wandering Soap Opera,2017,"Comedy,Drama,Fantasy",NaN,6.7,112
4,tt0111414,movie,A Thin Life,2018,Comedy,NaN,NaN,NaN

In [14]:
del final_list['titleType']

In [15]:
final_list.head()

,tconst,primaryTitle,startYear,genres,Metascore,imdbRating,imdbVotes
0,tt0069049,The Other Side of the Wind,2018,Drama,78,6.8,"5,960"
1,tt0072306,Toula ou Le génie des eaux,2017,Drama,NaN,6.4,8
2,tt0077649,Isolation of 1/8800000,2018,\N,NaN,6.9,17
3,tt0100275,The Wandering Soap Opera,2017,"Comedy,Drama,Fantasy",NaN,6.7,112
4,tt0111414,A Thin Life,2018,Comedy,NaN,NaN,NaN

In [16]:
def clean_year(file):
    del file["Unnamed: 0"]
    del file["ID"]
    del file["original_title"]
    return file

In [17]:
clean_year(movies_2018)
movies_2018.head(2)

,imdb_id,release_date,budget,revenue,genres,original_language,origin_country,production_countries name,spoken_languages name
0,tt1075113,2009-06-03,13000000,2651917,Drama,Français,FR,France,Français
1,tt1273221,2018-09-20,8000000,252676,Crime,English,GB,United Kingdom,English

In [18]:
movies_2018 = movies_2018.rename(columns={'imdb_id':'tconst'})

In [19]:
movies_2018.head(2)

,tconst,release_date,budget,revenue,genres,original_language,origin_country,production_countries name,spoken_languages name
0,tt1075113,2009-06-03,13000000,2651917,Drama,Français,FR,France,Français
1,tt1273221,2018-09-20,8000000,252676,Crime,English,GB,United Kingdom,English

In [21]:
final_list.count()

tconst          84294
primaryTitle    84294
startYear       84294
genres          84294
Metascore        9043
imdbRating      38941
imdbVotes       38939
dtype: int64